Revit 2024 API
ExporterIFCUtils.CollectGeometryInfo Method
Overload List
Name | Description
CollectGeometryInfo(ExporterIFC, IFCGeometryInfo, GeometryObject, XYZ, Boolean)
 Collects all the target geometry from the input geometry object and adds it as IFC handles to the IFCInfo.
CollectGeometryInfo(ExporterIFC, IFCGeometryInfo, GeometryObject, XYZ, Boolean, Transform)
 Collects all the target geometry from the input geometry object and adds it as IFC handles to the IFCInfo.
See Also
ExporterIFCUtils Class
ExporterIFCUtils Members
Autodesk.Revit.DB.IFC Namespace